# IFC_DMIsObjEnabled

## Description
Checks if the indicated object from the current IFC Data Mapping is enabled.

```pascal
FUNCTION IFC_DMIsObjEnabled(inStrObjName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMIsObjEnabled(inStrObjName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC